from __future__ import annotations

#TODO: heres i was thinking to create one json object with all bank info, this object will return info to tool

BANK_INFO = {

    "bank_branches": {
        "phone_number": "0800300200",
        "working_hours": "Пн - Пт: 09:00 - 18:00. Каса працює: 09:00 - 18:00.",
        "branches": [
            {
                "addres": "Київ, вул. Автозаводська 54/19",
                "trait": "Чергове відділення, яке забезпечене генератором безперебійного живлення.",
                "services": "Обслуговування фізичних та юридичних осіб. Зони де встановлено пандуси для людей з обмеженими можливостями. Банкомат на рийом та видачу коштів. Термінал самообслуговування",
            },
            {
                "addres": "Дніпро, пр. Дмитра Яворницького, 13/15 (літ. А-5)",
                "trait": "Чергове відділення, яке забезпечене генератором безперебійного живлення.",
                "services": "Обслуговування фізичних та юридичних осіб. Зони де встановлено пандуси для людей з обмеженими можливостями. Банкомат на рийом та видачу коштів. Термінал самообслуговування",
            },
            {
                "addres": "Львів, пр. Шевченка, 27",
                "trait": "",
                "services": "Обслуговування фізичних та юридичних осіб. Банкомат на рийом та видачу коштів. Термінал самообслуговування",
            },
            {
                "addres": "Львів, вул. Федьковича, буд. 51",
                "trait": "Чергове відділення, яке забезпечене генератором безперебійного живлення.",
                "services": "Обслуговування фізичних та юридичних осіб. Зони де встановлено пандуси для людей з обмеженими можливостями. Банкомат на рийом та видачу коштів. Термінал самообслуговування",
            },
            {
                "addres": "Київ, вул. Раїси Окіпної, 4-А",
                "trait": "",
                "services": "Обслуговування фізичних та юридичних осіб. Банкомат на рийом та видачу коштів. Термінал самообслуговування",
            },
            {
                "addres": "Київ, вул. Волоська, 18/17",
                "trait": "Чергове відділення, яке забезпечене генератором безперебійного живлення.",
                "services": "Обслуговування фізичних та юридичних осіб. Банкомат на рийом та видачу коштів. Термінал самообслуговування",
            },
            {
                "addres": "Київ, вул. Борщагівська, 117/125",
                "trait": "",
                "services": "Обслуговування фізичних та юридичних осіб. Зони де встановлено пандуси для людей з обмеженими можливостями. Банкомат на рийом та видачу коштів. Термінал самообслуговування",
            },
            {
                "addres": "Київ, вул. Б.Хмельницького, 17/52 - А",
                "trait": "",
                "services": "Обслуговування фізичних та юридичних осіб. Зони де встановлено пандуси для людей з обмеженими можливостями. Банкомат на рийом та видачу коштів. Термінал самообслуговування",
            },
            {
                "addres": "Київ, вул. Саксаганського/Тарасівська, 63/28.",
                "trait": "Чергове відділення, яке забезпечене генератором безперебійного живлення.",
                "services": "Обслуговування фізичних та юридичних осіб. Банкомат на рийом та видачу коштів. Термінал самообслуговування",
            },
            {
                "addres": "Київ, пр. Берестейський, 74-А",
                "trait": "",
                "services": "Обслуговування фізичних та юридичних осіб. Зони де встановлено пандуси для людей з обмеженими можливостями. Банкомат на рийом та видачу коштів. Термінал самообслуговування",
            },
            {
                "addres": "Київ, пр. Миколи Бажана, 26",
                "trait": "",
                "services": "Обслуговування фізичних та юридичних осіб. Зони де встановлено пандуси для людей з обмеженими можливостями. Банкомат на рийом та видачу коштів. Термінал самообслуговування",
            },
            {
                "addres": "Київ, пр. Володимира Івасюка, 10-А, корпус 5-А",
                "trait": "",
                "services": "Обслуговування фізичних та юридичних осіб. Банкомат на рийом та видачу коштів. Термінал самообслуговування",
            },
            {
                "addres": "Київ, вул. Велика Васильківська, 132-А",
                "trait": "Чергове відділення, яке забезпечене генератором безперебійного живлення.",
                "services": "Обслуговування фізичних та юридичних осіб. Банкомат на рийом та видачу коштів. Термінал самообслуговування",
            },
            {
                "addres": "Київ, пр. Повітряних сил України/вул. Богданівська 23/26",
                "trait": "Чергове відділення, яке забезпечене генератором безперебійного живлення.",
                "services": "Обслуговування фізичних та юридичних осіб. Зони де встановлено пандуси для людей з обмеженими можливостями. Банкомат на рийом та видачу коштів. Термінал самообслуговування",
            },
        ]
    }
}
